Ran Plan for 2 projects:

1. project: `grafana` dir: `apps/grafana` workspace: `grafana`
1. project: `localstack` dir: `apps/aws_localstack` workspace: `localstack`

### 1. project: `grafana` dir: `apps/grafana` workspace: `grafana`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # grafana_data_source.elasticsearch will be created
+ resource "grafana_data_source" "elasticsearch" {
      + access_mode              = "proxy"
      + basic_auth_enabled       = true
      + basic_auth_username      = "elastic"
      + database_name            = "docker-logs"
      + id                       = (known after apply)
      + is_default               = false
      + json_data_encoded        = jsonencode(
            {
              + es_version = "8.8.1"
              + time_field = "@timestamp"
            }
        )
      + name                     = "Elasticsearch"
      + secure_json_data_encoded = (sensitive value)
      + type                     = "elasticsearch"
      + uid                      = (known after apply)
      + url                      = "http://elastic.server.local.net"
    }

  # grafana_data_source.prometheus will be created
+ resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "Prometheus"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "http://prometheus.local.net"
    }

  # grafana_data_source.redis will be created
+ resource "grafana_data_source" "redis" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + name               = "redis"
      + type               = "redis-datasource"
      + uid                = (known after apply)
      + url                = "redis://redis.local.net:6379"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p grafana`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.mvaldes.dev/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgrafana%252Fgrafana)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p grafana`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `localstack` dir: `apps/aws_localstack` workspace: `localstack`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ami.test must be replaced
-/+ resource "aws_ami" "test" {
      ~ architecture         = "None" -> "x86_64" # forces replacement
      ~ arn                  = "arn:aws:ec2:us-east-1::image/ami-87ffd933" -> (known after apply)
      - ena_support          = false -> null
      ~ hypervisor           = "xen" -> (known after apply)
      ~ id                   = "ami-87ffd933" -> (known after apply)
      ~ image_location       = "None" -> (known after apply)
      ~ image_owner_alias    = "amazon" -> (known after apply)
      ~ image_type           = "machine" -> (known after apply)
      - kernel_id            = "None" -> null # forces replacement
      + manage_ebs_snapshots = (known after apply)
        name                 = "my_ami"
      ~ owner_id             = "000000000000" -> (known after apply)
      + platform             = (known after apply)
      + platform_details     = (known after apply)
      ~ public               = false -> (known after apply)
      - ramdisk_id           = "ari-1a2b3c4d" -> null # forces replacement
      - root_device_name     = "/dev/sda1" -> null # forces replacement
      ~ root_snapshot_id     = "snap-23986cd1" -> (known after apply)
      + sriov_net_support    = "simple" # forces replacement
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
      + usage_operation      = (known after apply)
      ~ virtualization_type  = "None" -> "paravirtual" # forces replacement

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - snapshot_id           = "snap-23986cd1" -> null
          - throughput            = 0 -> null
          - volume_size           = 15 -> null
          - volume_type           = "standard" -> null
        }
    }

  # aws_instance.my_instance must be replaced
-/+ resource "aws_instance" "my_instance" {
      ~ ami                                  = "ami-87ffd933" # forces replacement -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1::instance/i-a565447422ffa21ed" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1f" -> (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-a565447422ffa21ed" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-c2c63bb0" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-4.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.4" -> (known after apply)
      ~ public_dns                           = "None" -> (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-689e13ae" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p localstack`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.mvaldes.dev/lock?id=mvaldes14%252Fterraform%252Fapps%252Faws_localstack%252Flocalstack)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p localstack`
</details>
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`